pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S24ROM */
#define IFX_DMU_HP_PROCON_OTP0_S24ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S24ROM */
#define IFX_DMU_HP_PROCON_OTP0_S24ROM_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S25ROM */
#define IFX_DMU_HP_PROCON_OTP0_S25ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S25ROM */
#define IFX_DMU_HP_PROCON_OTP0_S25ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S25ROM */
#define IFX_DMU_HP_PROCON_OTP0_S25ROM_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S26ROM */
#define IFX_DMU_HP_PROCON_OTP0_S26ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S26ROM */
#define IFX_DMU_HP_PROCON_OTP0_S26ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S26ROM */
#define IFX_DMU_HP_PROCON_OTP0_S26ROM_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S27ROM */
#define IFX_DMU_HP_PROCON_OTP0_S27ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S27ROM */
#define IFX_DMU_HP_PROCON_OTP0_S27ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S27ROM */
#define IFX_DMU_HP_PROCON_OTP0_S27ROM_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S28ROM */
#define IFX_DMU_HP_PROCON_OTP0_S28ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S28ROM */
#define IFX_DMU_HP_PROCON_OTP0_S28ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S28ROM */
#define IFX_DMU_HP_PROCON_OTP0_S28ROM_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S29ROM */
#define IFX_DMU_HP_PROCON_OTP0_S29ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S29ROM */
#define IFX_DMU_HP_PROCON_OTP0_S29ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S29ROM */
#define IFX_DMU_HP_PROCON_OTP0_S29ROM_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S30ROM */
#define IFX_DMU_HP_PROCON_OTP0_S30ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S30ROM */
#define IFX_DMU_HP_PROCON_OTP0_S30ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S30ROM */
#define IFX_DMU_HP_PROCON_OTP0_S30ROM_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S31ROM */
#define IFX_DMU_HP_PROCON_OTP0_S31ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S31ROM */
#define IFX_DMU_HP_PROCON_OTP0_S31ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S31ROM */
#define IFX_DMU_HP_PROCON_OTP0_S31ROM_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S32ROM */
#define IFX_DMU_HP_PROCON_OTP1_S32ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S32ROM */
#define IFX_DMU_HP_PROCON_OTP1_S32ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S32ROM */
#define IFX_DMU_HP_PROCON_OTP1_S32ROM_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S33ROM */
#define IFX_DMU_HP_PROCON_OTP1_S33ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S33ROM */
#define IFX_DMU_HP_PROCON_OTP1_S33ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S33ROM */
#define IFX_DMU_HP_PROCON_OTP1_S33ROM_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S34ROM */
#define IFX_DMU_HP_PROCON_OTP1_S34ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S34ROM */
#define IFX_DMU_HP_PROCON_OTP1_S34ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S34ROM */
#define IFX_DMU_HP_PROCON_OTP1_S34ROM_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S35ROM */
#define IFX_DMU_HP_PROCON_OTP1_S35ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S35ROM */
#define IFX_DMU_HP_PROCON_OTP1_S35ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S35ROM */
#define IFX_DMU_HP_PROCON_OTP1_S35ROM_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S36ROM */
#define IFX_DMU_HP_PROCON_OTP1_S36ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S36ROM */
#define IFX_DMU_HP_PROCON_OTP1_S36ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S36ROM */
#define IFX_DMU_HP_PROCON_OTP1_S36ROM_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S37ROM */
#define IFX_DMU_HP_PROCON_OTP1_S37ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S37ROM */
#define IFX_DMU_HP_PROCON_OTP1_S37ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S37ROM */
#define IFX_DMU_HP_PROCON_OTP1_S37ROM_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S38ROM */
#define IFX_DMU_HP_PROCON_OTP1_S38ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S38ROM */
#define IFX_DMU_HP_PROCON_OTP1_S38ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S38ROM */
#define IFX_DMU_HP_PROCON_OTP1_S38ROM_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S39ROM */
#define IFX_DMU_HP_PROCON_OTP1_S39ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S39ROM */
#define IFX_DMU_HP_PROCON_OTP1_S39ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S39ROM */
#define IFX_DMU_HP_PROCON_OTP1_S39ROM_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S40ROM */
#define IFX_DMU_HP_PROCON_OTP1_S40ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S40ROM */
#define IFX_DMU_HP_PROCON_OTP1_S40ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S40ROM */
#define IFX_DMU_HP_PROCON_OTP1_S40ROM_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S41ROM */
#define IFX_DMU_HP_PROCON_OTP1_S41ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S41ROM */
#define IFX_DMU_HP_PROCON_OTP1_S41ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S41ROM */
#define IFX_DMU_HP_PROCON_OTP1_S41ROM_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S42ROM */
#define IFX_DMU_HP_PROCON_OTP1_S42ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S42ROM */
#define IFX_DMU_HP_PROCON_OTP1_S42ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S42ROM */
#define IFX_DMU_HP_PROCON_OTP1_S42ROM_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S43ROM */
#define IFX_DMU_HP_PROCON_OTP1_S43ROM_LEN (1u)

