pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM18X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM18X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM18X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM18X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM18X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM18X_OFF (18u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM19X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM19X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM19X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM19X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM19X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM19X_OFF (19u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM20X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM20X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM20X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM20X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM20X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM20X_OFF (20u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM21X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM21X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM21X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM21X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM21X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM21X_OFF (21u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM22X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM22X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM22X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM22X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM22X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM22X_OFF (22u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM23X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM23X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM23X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM23X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM23X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM23X_OFF (23u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM24X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM24X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM24X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM24X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM24X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM24X_OFF (24u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM25X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM25X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM25X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM25X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM25X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM25X_OFF (25u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM26X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM26X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM26X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM26X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM26X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM26X_OFF (26u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM27X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM27X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM27X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM27X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM27X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM27X_OFF (27u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM28X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM28X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM28X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM28X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM28X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM28X_OFF (28u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM29X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM29X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM29X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM29X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM29X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM29X_OFF (29u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM30X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM30X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM30X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM30X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM30X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM30X_OFF (30u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM31X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM31X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM31X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM31X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM31X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM31X_OFF (31u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM32X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM32X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM32X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM32X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM32X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM32X_OFF (0u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM33X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM33X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM33X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM33X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM33X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM33X_OFF (1u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM34X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM34X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM34X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM34X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM34X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM34X_OFF (2u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM35X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM35X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM35X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM35X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM35X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM35X_OFF (3u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX1_Bits.HSM36X */
#define IFX_DMU_SP_PROCONHSMCX1_HSM36X_LEN (1u)

